Revit 2027 API
DockablePaneProviderData.EditorInteraction Property
 Defines the interaction this pane has with the Active Editor when the pane becomes active.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public EditorInteraction EditorInteraction { get; set; }
Public Property EditorInteraction As EditorInteraction
	Get
	Set
public:
property EditorInteraction^ EditorInteraction {
	EditorInteraction^ get ();
	void set (EditorInteraction^ value);
}
member EditorInteraction : EditorInteraction with get, set
Property Value
EditorInteraction
Remarks
 Set to KeepAlive to keep the current editor active and keep active the current selection or Dismiss to dismiss the Editor and clear the active selection. Default is to KeepAlive the current editor.
See Also
Reference
DockablePaneProviderData Class
Autodesk.Revit.UI Namespace